app/controllers/tasks_controller.rb

  def show
    @result_task=Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    task = Task.create task_params
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Laundry"], ["description", "Use our soap"], ["created_at", 2017-03-22 19:45:36 UTC], ["updated_at", 2017-03-22 19:45:36 UTC]]